tests/performance/test-before-scenario.yml
# 測試使用 beforeScenario hook
config:
  target: "ws://localhost:8788"
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Test beforeScenario"
  processor: "./artillery-processor.js"

scenarios:
  - name: "Test BeforeScenario Hook"
    engine: ws
    beforeScenario: "getKitchenToken"
    flow:
      - connect:
          url: "/kitchen/{{ roomId }}?token={{ token }}"
      - think: 2
      - send:
          payload: '{"type":"ping"}'
      - think: 3