tests/performance/test-simple.yml
# 最簡單的 Artillery 測試 - 僅測試 HTTP
config:
  target: "http://localhost:8787"
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Simple test"

  processor: "./test-simple-processor.js"

scenarios:
  - name: "Test Token Generation"
    flow:
      - function: "testTokenGeneration"
      - get:
          url: "/api/v1/health"